[
  {
    "Time":"8:30a",
    "Speaker":"Amanda Sauder Maggard",
    "Grad":" ’04",
    "Room":302,
    "Position":"Administrator",
    "Company":"Florida Hospital Winter Garden",
    "Title":"“The Soft Stuff is the Hard Stuff: Building a Culture that Drives Performance, Excellence, and Bottom-Line Results” ",
    "Bio":"Amanda Sauder Maggard (’04) currently serves as the Administrator for Florida Hospital Winter Garden and Assistant Vice President for West Orange Development. In this role, Amanda will be overseeing the construction, ramp-up and daily operations of Florida Hospital’s Winter Garden facility. Prior to this role, Amanda served as the Assistant Administrator and Chief Operating Officer for Winter Park Memorial Hospital, a 320-bed facility. Amanda has more than eight years of healthcare experience with Florida Hospital and its parent company, Adventist Health System. Her background includes experience in hospital operations, organizational development, patient experience, corporate training, marketing, and fundraising. Amanda is most passionate about crafting a mission-driven culture and pursuing excellence in patient care.\nAmanda is a member of the American College of Healthcare Executives, a certified Senior Professional in Human Resources, and a Six Sigma Green Belt. She received undergraduate degrees in Journalism and Marketing from Union College in Lincoln, Nebraska, and a Masters of Business Administration from Webster University.\nAmanda is an internationally published author and an avid Dallas Cowboys fan. She and her husband, Michael, welcomed their son Griffin into the world in October 2013.\n",
    "Description":"Crafting the right organizational culture is key to long-term success in any industry. Organizations with strong employee engagement, low turnover, and consistent accountability processes drive operational performance, customer satisfaction, and profits. Building a culture often seems ambiguous, but there is a recipe that can be deployed across various industries."
  },
  {
    "Time":"8:30a",
    "Speaker":"David Kaiser ",
    "Grad":"’95",
    "Room":303,
    "Position":"System Engineer ",
    "Company":"Hortonworks",
    "Title":"“The New Model: Big Data Processing for Next Generation Business Value”",
    "Bio":"David Kaiser (’95) is a specialist in developing software to store and analyze big data (with an emphasis on optimization and performance improvement), as well as a self-taught engineer and a self-described “Linux geek.” David currently works as a Solutions Engineer for Hortonworks, a business software company founded by former Yahoo! engineers, and focusing on the development and support of Hadoop, an open source framework for storing and extracting insight from massive amounts of data.\nAfter graduating from Union College with a B.S. degree in Computer Information Systems, David worked as a Senior Consultant for KPMG Consulting, providing high-tech consulting to large West coast companies. He then became a Senior Linux Consultant at Linuxcare, Inc., developing and implementing customized open-source and proprietary software. David spent roughly the next decade at Esri, an international supplier of Geographic Information System (GIS) software. His responsibilities included designing and developing enterprise software architectures, with a specific focus on security, performance and scalability, and cross-platform compatibility. Former clients include some of the major companies in environmental, geographical, and scientific research areas. One of David’s former colleagues wrote, “David is the only person I’ve ever met that actually gets large scale data problems. He knows how to cut through the hype to make an actual working system.”\nDavid says that he “eats large blobs of data for lunch, hacks on anything from digital cameras to robots, and if it plugs in, runs on batteries, or just sits there and does nothing, chances are I’ve taken it apart already.” His hobbies include digital photography, tinkering with embedded computer projects using Arduino, Raspberry Pi or Beaglebone computers, engineering of music equipment, amateur radio and remote signaling and tracking of moving objects.\n",
    "Description":"Innovations in computing technology have led to the development of new platforms, such as Apache Hadoop, that enable a new style of data processing. This new approach offers low-cost scalable-computing on commodity hardware and provides data processing capabilities that combine the traditional SQL-based RDBMS with new mechanisms for continuous, real-time, and deep analysis of both stored and streaming information. The technology enables a modern data architecture that enterprises rely on for more timely and in-depth decision making."
  },
  {
    "Time":"8:30a",
    "Speaker":"Shannan Nelson",
    "Grad":"‘92",
    "Room":308,
    "Position":"Director of Business Operations,",
    "Company":"University of Kansas",
    "Title":"“How to Get Out of Business on Your Own Terms”",
    "Bio":"Shannan Nelson (’92) is currently the Director of Business Operations for the University of Kansas (KU), where his responsibilities include identifying alternative revenue resources, along with cost savings processes and programs. Shannan also has fiscal responsibilities for several departments on campus including Facility Services, Design & Capital Management, Parking, Procurement, Environmental Health, Sustainability and Energy Management.\nShannan has been a part of several start-up companies including one providing business supplies and Fish Development which focused on commercial construction and land development business. After leaving Fish Development, Shannan worked in financial consulting, business development and private equity for several years prior to joining the KU team. He has taught classes at MidAmerica Nazarene University and ran a closely contested race for state senator.\nShannan earned a Bachelor’s degree in Business Administration from Union College, where he served as President of the Associated Student Body his senior year. He subsequently completed an MBA from MidAmerica Nazarene University. Shannan and his wife Kristie have five children and Shannan still finds the energy to coach the baseball team at Midland Adventist Academy.\n",
    "Description":"You had a great idea, it worked for a while, and now you either have an offer you can’t refuse or the business just isn't making it. How do you get out in a positive way? Many businesses come to an end, sometimes on your terms and sometimes on someone else’s. How do you deal with the people, assets, partners and other stakeholders in a positive way. Learn key points in what a business owner should consider when creating an exit strategy."
  },
  {
    "Time":"8:30a",
    "Speaker":"Rand Strobel",
    "Grad":"’87",
    "Room":307,
    "Position":"Regional CIO",
    "Company":" Catholic Health Initiatives, Northwest Division",
    "Title":"“Healthcare IT - The Point of No Return is Behind Us” ",
    "Bio":"Rand Strobel (’87) is the Regional Chief Information Officer for Catholic Health Initiatives Northwest Division, which includes Franciscan Health System. The Northwest Division of CHI has approximately 14,000 employees, a combined medical staff of 2,600 providers, and $2 billion in annual revenue. It includes 10 hospitals, a post-acute care hospital, and the largest physician-led medical group in Washington State’s Puget Sound area with hundreds of physicians and providers in over 100 primary and specialty care clinics.\nRand has more than 26 years of experience in health care and information technology, most recently serving as the Vice President and Chief Information Officer at the University of Washington Medicine Valley Medical Center. He has also served in senior management positions with PeaceHealth, a multi-hospital system in the Pacific Northwest, including COO of an IT Division of PeaceHealth.\nRand is a member of the CIO Council of PACLAB, a regional medical laboratory consortium, and has served as a member of the IDX/GE Medical Imaging Advisory Board. He has been a speaker at numerous national conferences on strategic planning and healthcare information technology, including IHI Annual National Forum, Sachs Group National Conference, GE Medical Annual Users Group, and HealthTech Expert Panel. Rand is also a member of the College of Health Care Information Management Executives.\nAfter completing his Bachelor’s degree in business administration, emphasizing Management from Union College, Rand earned his MBA from Webster University in St. Louis, Missouri.",
    "Description":"Information technology is a key enabler to the delivery of healthcare. Billions of dollars are spent every year on healthcare IT with the belief it is improving healthcare. It is enabling incremental improvement, but we are rapidly approaching an inflexion point, where information technology in healthcare will enable transformational change. A convergence of consumerism, ubiquitous use of electronic health records, an unmanageable volume of clinical data, exponential advances in computing power, and advanced analytics, are reshaping and redefining healthcare. We are stepping across the threshold of this convergence, where it will challenge established roles in healthcare and the monopolistic nature of our current system of healthcare."
  },
  {
    "Time":"9:30a",
    "Speaker":"Mark Smith",
    "Grad":"‘90",
    "Room":302,
    "Position":"President",
    "Company":"Fort Hamilton Hospital",
    "Title":" “Creating a Culture of Execution: Driving Results in Healthcare Through 4DX” ",
    "Bio":"Mark Smith (’90) is the President of Fort Hamilton Hospital in the Kettering Health Network. Mark’s skills as a problem solver have played a significant role during his tenure with the Kettering Health Network, where he has served as Chief Financial Officer (CFO), Chief Operating Officer, President and network Vice President at various hospitals within the system prior to his current appointment.\n\nFollowing earning a Bachelor of Science degree in Business Administration emphasizing Accounting at Union College, passing the CPA exam, and completing a Juris Doctorate degree from the University of Nebraska, Mark practiced as an attorney in the areas of commercial law, taxation and workers’ compensation. He then served as Associate Professor of Accounting and Business Law at Union College for nearly a decade, during which he co-founded an accounting practice specializing in small business entity formation, tax consulting and business planning. Before joining the Kettering Network, Mark served as the CFO and Interim CEO for the physician-owned Nebraska Heart Hospital, where he learned a lot about what is important to physicians and how to work with them effectively.\n\nMark is known for his witty writing and commentary, delivered in deadpan style. His hobbies include photography and hanging out with his wife and energetic (to put it mildly) young sons, Branson and Harrison.",
    "Description":"Strategy is deeply important, but execution of the strategy is what puts the rubber to the road. Mark will describe how Franklin Covey's Four Disciplines of Execution (4DX) were used at Fort Hamilton Hospital to drive a 14.5% growth in net revenue last year (versus a budget that called for a 3% increase) in one of the most competitive markets for healthcare in all of Ohio.\n\n"
  },
  {
    "Time":"9:30a",
    "Speaker":"Codi Davidson Jahn",
    "Grad":"’05",
    "Room":303,
    "Position":"Owner",
    "Company":"High Plains Holding Company",
    "Title":"“Interested in Starting a Business? Just Do It!”",
    "Bio":"Codi Davidson Jahn (’05) is the co-owner of High Plains Holding Company, which sells new and used shipping containers for all types of uses, including storage and prefab buildings. Prior to launching her business, Codi was a sales representative in the industry. Her sales expertise led to multiple industry awards for high sales volume and new customers, as well as several nominations for both leading and sales rep of the year. Codi’s sales proficiency and passion has propelled her business to far exceed annual projections from the original business plan. Her company also has a unique philanthropic model.\nIn addition to being an accomplished business owner, Codi is most importantly a wife to fellow Union alum Caleb, and a magnificent mother to her two charming children, Conner and Callista. Codi completed a Bachelor’s degree in Business Administration with an emphasis on Marketing at Union, followed by a Master’s in Business Administration at Avila University in 2010.\n",
    "Description":"Are you interested in starting a small business but scared to jump into the great unknown? You can do it! Join Codi Jahn as she shares how she and her husband started a business. She will be talking about lessons learned and will provide suggestions on how to avoid some of the pitfalls they discovered along the way. Codi will also share some tools they have found helpful and offer her encouragement for those interested in taking the plunge and becoming small business owners."
  },
  {
    "Time":"9:30a",
    "Speaker":"Keil Wilson",
    "Grad":"‘98",
    "Room":307,
    "Position":"Owner",
    "Company":"Keil Consulting",
    "Title":"“Project Management: Agile for Managers”",
    "Bio":"Keil Wilson (’98) is the founder of Keil Consulting, Inc., a company providing technical project management and agile software development to clients. Keil has over 15 years of experience as a computer systems administrator, consultant, developer and project manager. Major projects include management of an eight-person development team building an application for 2,300 law enforcement officers and an $800,000+ contract for system implementation.\nKeil has also served as Director of Software Development for Five Nines Technology Group, guiding the company’s software development department while assisting in implementing budgeting and reporting processes to accurately track financial metrics and establishing new processes for project engagement, recruiting and hiring, employee review and professional development. In addition, Keil has worked extensively with the Nebraska Department of Roads as both a consultant and part of the management team for application development, taking the lead on projects that improved developer productivity and accuracy, reduced system maintenance and increased user satisfaction. Keil completed a Bachelor of Science degree in Computer Information Systems at Union College in 1998.\nKeil and his wife Susan have four children who keep them on the run. Keil enjoys coaching football and being a part of all the activities the kids are involved with.\n",
    "Description":"Failure is an essential part of Project Management! Learn what is different about the Agile approach to Project Management and how to apply the concepts of Agile Project Management to projects of any kind. This technique will help you make better decisions on projects earlier in the process to improve that all-important ROI."
  },
  {
    "Time":"9:30a",
    "Speaker":"Shelli Johnson Okimi",
    "Grad":"’07",
    "Room":308,
    "Position":"Director, Organizational Readiness,",
    "Company":"Adventist Health System",
    "Title":"“Change Management: Leadership Alignment in Organizational Readiness”",
    "Bio":"Shelli Johnson Okimi (’07) is the Director of Organizational Readiness for Adventist Health System’s iSynergy initiative. Shelli has an MBA from Webster University and graduated from Union’s Division of Business and Computer Science in 2007 with her BS in Business Administration with a Marketing emphasis. Shelli has worked for Adventist Health System in a variety of roles including Director of Human Resources at Emory-Adventist Hospital in Smyrna, Georgia and Senior Manager of Organizational Design and Workforce Transition. Shelli is a Senior Professional in Human Resources and enjoys her work managing change for an organization of nearly 73,000 employees. Shelli and her husband, Justin, live in Hutchinson, Minnesota.\n",
    "Description":"Managing change is a vital process in successful organizations. How do great organizations prepare people, resources and systems for massive change? What is the role of leadership in the change management process? What steps can be taken to align leadership to the priorities and practices that produce efficient and effective execution of change? Learn more about change management through the lens of Adventist Health System’s enterprise resource planning initiative, internally referred to as iSynergy, which will impact employees across the organization."
  },
  {
    "Time":"10:30a",
    "Speaker":"Sam Huenergardt",
    "Grad":"‘99",
    "Room":303,
    "Position":"President and CEO",
    "Company":"Central Texas Medical Center",
    "Title":"“Culture and Company - Upgrading Your Workforce”",
    "Bio":"Sam Huenergardt (’99) has served as the President and CEO of Central Texas Medical Center since 2010. He has spent his entire post graduate career with Adventist Health System in varying capacities, beginning with finance and accounting.\nSam graduated from Union College in Lincoln, Nebraska with a bachelor’s degree in Business with emphasis in Accounting and Finance. After passing the CPA exam, he began his finance residency at Florida Hospital, Adventist Health Systems’ flagship hospital. He has taken increased responsibility in several finance roles in the company in North Carolina and Kansas, before his executive role as CFO, then COO at Gordon Hospital in Calhoun, Georgia.\nSam’s passion is for driving positive change into healthcare. If it’s good for the patient, and community, he is looking for a way to make it sustainable. At each stop in his career, growing a productive, engaged, employed physician group has been a priority. Productivity improvement and service expansion have dotted his work history, but his favorite talking points center around the patient experience as it relates to helping Central Texas Medical Center meet its mission of extending the healing ministry of Christ.\nSam loves helping others, and has served the church in various capacities. He chairs the board of San Marcos Hays County EMS and he also serves on the executive board of the Greater San Marcos Partnership, a regional economic development organization.\n",
    "Description":"It’s easy to work at any company on a good day, but how is it to work on a bad day at a company with a “bad” culture? The differences between healthy and unhealthy organizations more often than not are cultural. How should employees interact with each other, and how should managers support their staff? This session will focus on how supervisors can use short, regular meetings with employees to re-recruit top performers and improve performance for the entire organization by driving low performers up or out. Sam will share his experience on how to use well-tested tips to create a \"just culture\" and high performance."
  },
  {
    "Time":"10:30a",
    "Speaker":"Christy Bales Prevo",
    "Grad":"’97",
    "Room":307,
    "Position":" Owner",
    "Company":"Tiger Tots Child Development Center & Academy of Early Learning",
    "Title":" “From Diapers to Dollars: How Embracing Core Values Can Lead to Exponential Growth!”",
    "Bio":"Christy Bales Prevo (’97) is majority owner and business manager of Tiger Tots Child Development Center and Tiger Tots Academy of Early Learning. Christy provides the business backbone and financial knowledge that have been instrumental in leading Tiger Tots on its journey from a once small neighborhood preschool to becoming a respected leader in early childhood education, growing over seven years from serving 15 students to its current enrollment of 265 students. Christy is known for her hard work, generosity and personal interest in the success of each Tiger Tot’s student and staff member. After graduating from Union College with a Business Administration Bachelor’s degree emphasizing Finance, Management and Accounting, Christy earned an MBA from William Woods University.\nChristy has worked as Controller for Jeffrey E. Smith Companies, financially managing a variety of real estate and health care companies. She also spent time as Business Manager for a parochial school system and has experience working with non-profit agencies.\nChristy and husband Paul believe in the important work of charitable organizations in the local community and have been supporters of agencies such as Voluntary Action Center, Rainbow House, First Chance for Children, Habitat for Humanity and The United Way. Christy has also been active in Rotary Club and serves on the Advisory Board for the Division of Business and Computer Science at Union College, to ensure other students receive the same well rounded business education she received.",
    "Description":"Christy and Paul Prevo will describe how embracing core values has led to exponential growth for their early childhood education business. Their business Tiger Tots is currently one of the largest and most recognized preschool programs in mid-Missouri. Christy and Paul will share important lessons they have learned from their rapid growth and how implementing core values can separate you from the competition and propel your business or organization to the next level."
  },
  {
    "Time":"10:30a",
    "Speaker":"Steve Johnson",
    "Grad":"’87",
    "Room":302,
    "Position":"Chief Revenue Officer",
    "Company":"HootSuite",
    "Title":" “Global Communication Disruption - and What It Means for You”",
    "Bio":"Steve Johnson (’87) is Chief Revenue Officer at HootSuite, where he is responsible for global company revenue, customer success and customer support. HootSuite aids clients in managing multiple social media channels and has many high-profile customers including the White House, State Department and 79 of the Fortune 100. HootSuite currently has over 10 million users. Steve also serves on the Boards of Certify, LLC and Mobify, assisting with strategy, go to market advice and growth plans.\nSteve has over 20 years of experience working with software companies in all stages of life: start-up, rapid growth, mature and turn around. His areas of expertise include channel strategy, social media management applications, marketing automation software/online sales management, web analytics, database and accounting applications.\nSteve’s experiences include working at the Vice President level for both Constant Contact and Blackbaud, developing partnerships, strategy and channel programs. As Vice President for Sales at Voice Automation, a ground level software start-up, Steve developed the company sales strategy and started the initial partnerships. He was the Director of Channels at Apropos Technology during the time the company went public (IPO), and revenues went from $4 million to $32 million during his tenure. Steve was also Regional Sales Manager for both Scopus Technology and Progress Software, dealing with large corporate clients such as K-mart and Johnson Controls.\nAfter completing his Bachelor’s degree in Business Administration with an emphasis in Accounting at Union College, Steve earned an MBA emphasizing Marketing, Management and International Business from the Kellogg School of Management at Northwestern University.\n",
    "Description":"Do you want to know what it is like to be a part of a dynamic company that is changing the way organizations around the world are communicating? Steve Johnson will discuss global communication trends, how Hootsuite is leveraging this disruption to create a high growth company that counts 79 of the Fortune 100 as clients along with the White House and State Department. Steve will share some of the keys to their success, how they have leveraged the concept of Noble Purpose and also how they have raised $250 million to help power this growth. Hootsuite's mission is to help organizations transform messages into meaningful relationship - and this focus has helped us transform communication management in the age of social media."
  },
  {
    "Time":"10:30a",
    "Speaker":"Cheri Carrick",
    "Grad":"‘90",
    "Room":308,
    "Position":"Director",
    "Company":"Business Development & Marketing, Florida Hospital",
    "Title":"“Better Health, Better Care and Reduced Cost”",
    "Bio":"Cheri Carrick is the Director of Business Development and Marketing for Florida Hospital Healthcare System, where she serves as client liaison for the 23 Florida Hospital facilities in the Florida Division of Adventist Health System. Cheri’s experience includes facilitating development and implementation of a health insurance company which encompassed developing market analysis, strategy, name and branding, small and large group products, state filings, pricing model, vendor partnerships, broker education and the company website, as well as creating an initial client base of 50 employers. Cheri has over 20 years of experience in healthcare, working primarily in business development strategic initiatives in multiple Florida Hospital business units.\n\nCheri graduated from Union College with a bachelor’s degree in Business Administration, emphasizing both management and accounting. She completed an MBA at the University of Central Florida in 1995. Cheri is a gifted pianist who has released an album and has also appeared in a documentary on single Christian adults. She is passionate about helping others know God and works to accomplish that goal through seminars and music.",
    "Description":"Learn how a division of Adventist Health Systems is creating a new model where healthcare will be provided in a very different way.  See how Florida Hospital is embracing the second curve of healthcare to create better health, better care and reduced cost.The goal is that everyone wins!"
  },
  {
    "Time":"11:30a",
    "Speaker":"Sissel Schlisner Jacob",
    "Grad":"‘05",
    "Room":307,
    "Position":" Director, Supply Chain Management",
    "Company":"Porter Adventist Hospital",
    "Title":"“Finding Love in the Workplace”",
    "Bio":"Sissel Schlisner Jacob (’05) has served as the Director of Supply Chain Management for Centura Health, dedicated to Porter Adventist Hospital, since 2010 and recently added Environmental Services to the areas she is responsible for as well as supply chain leadership to Littleton Adventist Hopital. She has ten years of experience with supply chain management, serving various hospitals within the Adventist Health System network including locations in Florida, Illinois and Colorado. Sissel thrives on building good relationships at work in order to increase productivity and satisfaction for all members of her teams.\nAfter earning her bachelor’s degree in Business Administration emphasizing management and finance at Union College in 2005, Sissel completed her MBA at Webster University in 2006. She loves to travel, cook, and backpack. She is married to Jeremy and is the mother to a very busy boy, Edward.",
    "Description":"Leading with love can form better partnerships, propel your career, and make it possible for you to do more with less in the workplace. It's no longer just who you know, it's how you treat those you know. While knowledge and skills are important in the workplace, relationships are even more important."
  },
  {
    "Time":"11:30a",
    "Speaker":"Kent Stahly",
    "Grad":"",
    "Room":303,
    "Position":"Investments and finance teacher extraordinaire",
    "Company":"Union College",
    "Title":" “Stock Valuation and Market Prices” (Regular investments class)",
    "Bio":"Kent Stahly has taught Investments and Finance at Union College since 1988, and continues to impress students with his in-depth knowledge of the subjects (aided by long-term experience managing his own investments portfolio). Most of his colleagues have taken his Investments course, and appreciate his emphasis on good stewardship and earning more to be able to give more.\nKent earned a Bachelor’s degree in Finance from the University of Nebraska in 1967 and a Master of Arts degree in Economics in 1969. Following his graduate education, Kent worked in the Finance Department at Ford Motor Company headquarters for 16 years. In addition to teaching, Kent continues to work with investments and real estate, alongside Carol, his wife of more than 45 years. In his free time, Kent works out at a health club and keeps up with all things economics and finance.\n",
    "Description":"Feeling nostalgic for a Kent class? Want a little brush-up on investments? Join Kent Stahly as he teaches his regular investments class. Leading up to this class, modern portfolio theory, the time value of money, and stock basics and analytics have all been covered, so this class period dives a little deeper. Content includes forecast of key variables used for valuing stocks, a review of Value Line information on individual stocks, and discussion of general stock valuation model types with emphasis on the dividend valuation model."
  },
  {
    "Time":"11:30a",
    "Speaker":"Mike Carlson",
    "Grad":"‘85",
    "Room":302,
    "Position":"President",
    "Company":"Siemens Smart Grid NA",
    "Title":"“A Case for Change”",
    "Bio":"Mike Carlson (’85) is the President of Siemens Smart Grid NA, located in Minnetonka, MN, and he also serves as the President & CEO of eMeter, Inc., Siemens energy software product solution group headquartered in Foster City, CA. In both of these roles, Mike is responsible for defining the business strategy and execution plan that incorporates product management, engineering/R&D, sales, delivery and customer support. He is accountable for the definition, execution and results of the business plan and performance for shareholder return and customer value.\nPrior to joining Siemens, Mike spent five years with General Electric in Atlanta, Ga., where he served as General Manager, Software Solutions for GE’s Energy Management Digital Energy business. In his role, Mike was responsible for the global enterprise software platform business within Digital Energy, including accountability for all grid software solutions, profit and loss, business strategy and operations as well as driving a solution strategy for a global Smart Grid product offering.\nThroughout his 30-year career, Mike has held positions of leadership responsibility in the medical and energy industries, including Vice President and Chief Information Officer at Xcel Energy, where he was a key player in designing and implementing the utility’s groundbreaking smart grid project, the $100 million SmartGrid City in Boulder, CO and Senior Practice Leader for Arthur Andersen’s Finance and Technology business based in Minneapolis, MN.\nMike holds a B.S. in Business Administration with emphases in accounting, management and computer science from Union College and an M.B.A. in finance from Pepperdine University. He and his wife Marie (Trana) ’84 have three sons and live in Minnetonka, MN. Curt is a Senior at Union and will graduate this summer while Dan is currently a Junior at Union and plans to graduate in the summer of ’16.",
    "Description":"Understanding the value and risk of change is important for any successful leader. In this session, Mike Carlson will discuss how to approach change to minimize risks and maximize results. Using specific examples from the Energy/Utility sector, arguably one of the industries that has undergone the least amount of change since Edison first envisioned it the late 1800s, Mike will share his experience and insights. He may also give us some explanation of exactly what a \"Smart Grid\" is!"
  },
  {
    "Time":"11:30a",
    "Speaker":"Cameron Ludwig",
    "Grad":"‘97",
    "Room":308,
    "Position":"VP, Analytics and Enterprise Services",
    "Company":"Blue Cross and Blue Shield of Nebraska",
    "Title":"“Effective Communication Through Data Visualization”",
    "Bio":"Cameron Ludwig (’97) is Vice President, Analytics and Enterprise services, for Blue Cross and Blue Shield of Nebraska (BCBSNE). Ludwig has served in a variety of roles at BCBSNE. He began as a consultant in 2001 and moved to the information services department in 2004. Since then, he has worked in IS, marketing and operations, leading the client and analytics team, small group account management and service and consumer sales teams. Most recently, Ludwig focused on corporate data governance, analytics and enterprise process optimization. Ludwig has a background as a technology consultant and analyst with a number of firms, including Cap Gemini and Sogeti. He is active in community service and currently serves as a long-time mentor through the TeamMates Mentoring Program. Ludwig earned a bachelor’s degree in Business Administration with an emphasis in Management from Union College in 1997 and a Masters of Business Administration from Bellevue University in 2004.\n",
    "Description":"Have you ever been given an overwhelming amount of information and then been told to make a decision based on it? Have you ever struggled to help someone else see what seemed obvious to you? Cameron Ludwig will share best practices in data visualization to make decisions more effective and efficient through effective communication of the key ideas."
  }
]